dev plan in payments (when passing secrets):
``` terraform
 # aws_kms_key.env_secrets will be created
  + resource "aws_kms_key" "env_secrets" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 30
      + description                        = "Encryption key for environment secrets"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::332913666507:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags_all                           = {
          + "iac-project" = "FitnessKeeper/terraform-payments"
        }
    }

  # aws_secretsmanager_secret.env_secrets["AMPLITUDE_API_KEY"] will be created
  + resource "aws_secretsmanager_secret" "env_secrets" {
      + arn                            = (known after apply)
      + description                    = "Secrets for container environmental variables"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + kms_key_id                     = (known after apply)
      + name                           = "payments/dev/env-var/AMPLITUDE_API_KEY"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = {
          + "iac-project" = "FitnessKeeper/terraform-payments"
        }
    }

  # aws_secretsmanager_secret.env_secrets["APPSFLYER_AUTHENTICATION"] will be created
  + resource "aws_secretsmanager_secret" "env_secrets" {
      + arn                            = (known after apply)
      + description                    = "Secrets for container environmental variables"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + kms_key_id                     = (known after apply)
      + name                           = "payments/dev/env-var/APPSFLYER_AUTHENTICATION"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = {
          + "iac-project" = "FitnessKeeper/terraform-payments"
        }
    }

  # aws_secretsmanager_secret.env_secrets["BRAINTREE_MERCHANT_ID"] will be created
  + resource "aws_secretsmanager_secret" "env_secrets" {
      + arn                            = (known after apply)
      + description                    = "Secrets for container environmental variables"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + kms_key_id                     = (known after apply)
      + name                           = "payments/dev/env-var/BRAINTREE_MERCHANT_ID"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = {
          + "iac-project" = "FitnessKeeper/terraform-payments"
        }
    }

  # aws_secretsmanager_secret.env_secrets["BRAINTREE_PRIVATE_KEY"] will be created
  + resource "aws_secretsmanager_secret" "env_secrets" {
      + arn                            = (known after apply)
      + description                    = "Secrets for container environmental variables"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + kms_key_id                     = (known after apply)
      + name                           = "payments/dev/env-var/BRAINTREE_PRIVATE_KEY"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = {
          + "iac-project" = "FitnessKeeper/terraform-payments"
        }
    }

  # aws_secretsmanager_secret.env_secrets["BRAINTREE_PUBLIC_KEY"] will be created
  + resource "aws_secretsmanager_secret" "env_secrets" {
      + arn                            = (known after apply)
      + description                    = "Secrets for container environmental variables"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + kms_key_id                     = (known after apply)
      + name                           = "payments/dev/env-var/BRAINTREE_PUBLIC_KEY"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = {
          + "iac-project" = "FitnessKeeper/terraform-payments"
        }
    }

  # aws_secretsmanager_secret.env_secrets["ITERABLE_RK_API_KEY"] will be created
  + resource "aws_secretsmanager_secret" "env_secrets" {
      + arn                            = (known after apply)
      + description                    = "Secrets for container environmental variables"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + kms_key_id                     = (known after apply)
      + name                           = "payments/dev/env-var/ITERABLE_RK_API_KEY"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = {
          + "iac-project" = "FitnessKeeper/terraform-payments"
        }
    }

  # aws_secretsmanager_secret.env_secrets["ITUNES_SECRET"] will be created
  + resource "aws_secretsmanager_secret" "env_secrets" {
      + arn                            = (known after apply)
      + description                    = "Secrets for container environmental variables"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + kms_key_id                     = (known after apply)
      + name                           = "payments/dev/env-var/ITUNES_SECRET"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = {
          + "iac-project" = "FitnessKeeper/terraform-payments"
        }
    }

  # aws_secretsmanager_secret.env_secrets["PAYPAL_PASSWORD"] will be created
  + resource "aws_secretsmanager_secret" "env_secrets" {
      + arn                            = (known after apply)
      + description                    = "Secrets for container environmental variables"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + kms_key_id                     = (known after apply)
      + name                           = "payments/dev/env-var/PAYPAL_PASSWORD"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = {
          + "iac-project" = "FitnessKeeper/terraform-payments"
        }
    }

  # aws_secretsmanager_secret.env_secrets["PAYPAL_SIGNATURE"] will be created
  + resource "aws_secretsmanager_secret" "env_secrets" {
      + arn                            = (known after apply)
      + description                    = "Secrets for container environmental variables"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + kms_key_id                     = (known after apply)
      + name                           = "payments/dev/env-var/PAYPAL_SIGNATURE"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = {
          + "iac-project" = "FitnessKeeper/terraform-payments"
        }
    }

  # aws_secretsmanager_secret.env_secrets["PAYPAL_USERNAME"] will be created
  + resource "aws_secretsmanager_secret" "env_secrets" {
      + arn                            = (known after apply)
      + description                    = "Secrets for container environmental variables"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + kms_key_id                     = (known after apply)
      + name                           = "payments/dev/env-var/PAYPAL_USERNAME"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = {
          + "iac-project" = "FitnessKeeper/terraform-payments"
        }
    }

  # aws_secretsmanager_secret.env_secrets["STATIC_ASSETS_ORIGIN_IDENTITY"] will be created
  + resource "aws_secretsmanager_secret" "env_secrets" {
      + arn                            = (known after apply)
      + description                    = "Secrets for container environmental variables"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + kms_key_id                     = (known after apply)
      + name                           = "payments/dev/env-var/STATIC_ASSETS_ORIGIN_IDENTITY"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = {
          + "iac-project" = "FitnessKeeper/terraform-payments"
        }
    }

  # aws_secretsmanager_secret_version.env_secrets["AMPLITUDE_API_KEY"] will be created
  + resource "aws_secretsmanager_secret_version" "env_secrets" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.env_secrets["APPSFLYER_AUTHENTICATION"] will be created
  + resource "aws_secretsmanager_secret_version" "env_secrets" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.env_secrets["BRAINTREE_MERCHANT_ID"] will be created
  + resource "aws_secretsmanager_secret_version" "env_secrets" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.env_secrets["BRAINTREE_PRIVATE_KEY"] will be created
  + resource "aws_secretsmanager_secret_version" "env_secrets" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.env_secrets["BRAINTREE_PUBLIC_KEY"] will be created
  + resource "aws_secretsmanager_secret_version" "env_secrets" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.env_secrets["ITERABLE_RK_API_KEY"] will be created
  + resource "aws_secretsmanager_secret_version" "env_secrets" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.env_secrets["ITUNES_SECRET"] will be created
  + resource "aws_secretsmanager_secret_version" "env_secrets" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.env_secrets["PAYPAL_PASSWORD"] will be created
  + resource "aws_secretsmanager_secret_version" "env_secrets" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.env_secrets["PAYPAL_SIGNATURE"] will be created
  + resource "aws_secretsmanager_secret_version" "env_secrets" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.env_secrets["PAYPAL_USERNAME"] will be created
  + resource "aws_secretsmanager_secret_version" "env_secrets" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.env_secrets["STATIC_ASSETS_ORIGIN_IDENTITY"] will be created
  + resource "aws_secretsmanager_secret_version" "env_secrets" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.payments.data.aws_iam_policy_document.task_execution_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "task_execution_role_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:secretsmanager:us-east-1:332913666507:secret:runkeeper-dockerhub-secret-T6X3oj",
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ecs:DescribeTasks",
              + "ecs:ExecuteCommand",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.payments.aws_ecs_service.service will be updated in-place
  ~ resource "aws_ecs_service" "service" {
        id                                 = "arn:aws:ecs:us-east-1:332913666507:service/ue1dev-runkeeper-services/payments-dev-api-service"
        name                               = "payments-dev-api-service"
        tags                               = {
            "Application"      = "payments-dev"
            "Env"              = "dev"
            "TerraformManaged" = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:332913666507:task-definition/payments-dev-api:70" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.payments.aws_ecs_task_definition.task must be replaced
-/+ resource "aws_ecs_task_definition" "task" {
      ~ arn                      = "arn:aws:ecs:us-east-1:332913666507:task-definition/payments-dev-api:70" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:332913666507:task-definition/payments-dev-api" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "payments-dev-api" -> (known after apply)
      ~ revision                 = 70 -> (known after apply)
        tags                     = {
            "Application"      = "payments-dev"
            "Env"              = "dev"
            "TerraformManaged" = "true"
        }
        # (9 unchanged attributes hidden)
    }

  # module.payments.aws_iam_role_policy.task_execution_role_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "task_execution_role_policy" {
        id     = "payments-dev-api-ecsTaskExecutionRole:payments-dev-api-ecs-task-execution-role-policy"
        name   = "payments-dev-api-ecs-task-execution-role-policy"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:secretsmanager:us-east-1:332913666507:secret:runkeeper-dockerhub-secret-T6X3oj"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ecs:ExecuteCommand",
                          - "ecs:DescribeTasks",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ecs:us-east-1:332913666507:task-definition/payments-dev-api:70"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 24 to add, 2 to change, 1 to destroy.